<a href="https://colab.research.google.com/github/Manikandan-professional/Cities-Internet-Prices/blob/main/Cities_Internet_Prices.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Cities Internet Prices**

**Importing the Necessary Moduels**

In [74]:
import pandas as pd
import numpy as np

**Reading the csv file**

In [75]:
a=pd.read_csv('https://raw.githubusercontent.com/Manikandan-professional/Cities-Internet-Prices/main/cities_internet_prices.19-10-2021.csv')
a

                 City  ...  "InternetPrice"
0       New York City  ...        66.441395
1    Washington, D.C.  ...        60.590455
2       San Francisco  ...        68.988824
3              Berlin  ...        35.827084
4         Los Angeles  ...        66.690222
..                ...  ...              ...
514            Kaunas  ...        11.211636
515           Antwerp  ...        54.136225
516          Zaragoza  ...        31.842382
517         Arlington  ...        58.875000
518            Jubail  ...        52.158321

[519 rows x 4 columns]

**Conversion of csv file to DataFrame**

In [76]:
df=pd.DataFrame(a)

**First five row preview of the loaded dataset**

In [77]:
df.head()

               City  ...  "InternetPrice"
0     New York City  ...        66.441395
1  Washington, D.C.  ...        60.590455
2     San Francisco  ...        68.988824
3            Berlin  ...        35.827084
4       Los Angeles  ...        66.690222

[5 rows x 4 columns]

**Columns in the DataFrame(df)**

In [78]:
list(df.columns)

['City', ' "Region"', ' "Country"', ' "InternetPrice"']

In [79]:
df.isnull().sum()

City                0
 "Region"           0
 "Country"          0
 "InternetPrice"    0
dtype: int64

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 519 entries, 0 to 518
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   City              519 non-null    object
 1    "Region"         519 non-null    object
 2    "Country"        519 non-null    object
 3    "InternetPrice"  519 non-null    float64
dtypes: float64(1), object(3)
memory usage: 16.3+ KB

In [81]:
df[' "Region"']

0                   "New York"
1       "District of Columbia"
2                 "California"
3                           ""
4                 "California"
                ...
514                         ""
515           "Flemish Region"
516                   "Aragon"
517                 "Virginia"
518         "Eastern Province"
Name:  "Region", Length: 519, dtype: object

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 519 entries, 0 to 518
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   City              519 non-null    object
 1    "Region"         519 non-null    object
 2    "Country"        519 non-null    object
 3    "InternetPrice"  519 non-null    float64
dtypes: float64(1), object(3)
memory usage: 16.3+ KB

**Identifying the Datatypes of the DataFrame(df)**

In [83]:
df.dtypes

City                 object
 "Region"            object
 "Country"           object
 "InternetPrice"    float64
dtype: object

**Renaming the Column name by removing --"--**

In [89]:
df=df.rename(columns={'City':'City',' "Region"':'Region',' "Country"':'Country',' "InternetPrice"':'InternetPrice'})

In [90]:
df.dtypes

City              object
Region            object
Country           object
InternetPrice    float64
dtype: object

**Data Cleaning and removing --"-- from the datapoints**

In [108]:
reg=pd.DataFrame(df['Region'].str.replace('"',''))
Coun=pd.DataFrame(df['Country'].str.replace('"',''))

In [110]:
df['Region']=reg['Region']
df['Country']=Coun['Country']

In [111]:
df.head()

               City  ... InternetPrice
0     New York City  ...     66.441395
1  Washington, D.C.  ...     60.590455
2     San Francisco  ...     68.988824
3            Berlin  ...     35.827084
4       Los Angeles  ...     66.690222

[5 rows x 4 columns]